"""
Ответы на вопросы:
1. Можно ли определить наиболее и наименее значимые
входные сигналы? Если да, то какие именно сигналы являются
наиболее/наименее значимыми в этой задаче?
- Можно! Сигналы определяются колличеством нулей и единиц 
переданных в массиве условии.

2.Можно ли повлиять на значимость входных сигналов? Если
да, то каким образом?
- Можно! Сигналы определяются колличеством нулей и единиц 
переданных в массиве условии, ссотвественно повлиять на результат
можно передав в ответ на условии 1 или 0

3.Что означают числа в массиве prediction? Какой вывод об
успешности обучения можно сделать?
-Это вероятность того или инного события после вычислений, 
чем больше раз запускать код тем точнее становится результат.

4.Каким образом изменится результат обучения, если
увеличить или уменьшить количество эпох? Проведите несколько
соответствующих экспериментов.
-Увеличение колличесвта эпох приведет к более точным ответам

"""
